#include <stdio.h>
#include <stdlib.h>

//操作符详解

/*
算术操作符（双目）
    + - * / %
  1.除了%操作符之外，其他的几个操作符可以作用于整数和浮点数。
  2.对于/操作符如果两个操作符都为整数，执行整数除法，而只要有浮点数就执行浮点数除法
  3.%操作符的两个操作数必须为整数，返回的是整除之后的余数

int main()
{
    int a=5/2;  //商2余1
    int b=5%2;
    double c=5/2.0;
    printf("a=%d\n",a);
    printf("b=%d\n",b);
    printf("c=%f\n",c);
    return 0;
}
*/

/*
移位操作符（移二进制位）
    << 左移操作符
    左边抛弃，右边补0

    >> 右移操作符
    1.算术右移（常用）
        右边丢弃，左边补原符号位
    2.逻辑右移
        右边丢弃，左边补0
警告：对于移位操作符，不要移动负数位，这个是标准未定义的。

int main()
{
    //整数的二进制表示有：原码、反码、补码
    //存储到内存的是补码
    //正整数原反补相同
    //-1
    //10000000000000000000000000000001 - 原码
    //11111111111111111111111111111110 - 反码
    //11111111111111111111111111111111 - 补码
    int a=16;
    //00000000000000000000000000010000
    int b =a>>1;
    //00000000000000000000000000001000
    printf("%d\n",b);
    //判断移位方式，如果是算术移位则结果为-1，如果是逻辑移位则为1
    //一般都是用算术移位
    int c=-1;
    int d=c>>1;
    printf("%d\n",d);
    return 0;
}
*/

/*
位操作符 - 二进制位
    &  按位与
    |  按位或
    ^  按位异或
    注：它们的操作数必须是整数。

int main()
{
    int a=3;
    //3 - 00000000000000000000000000000011
    int b=5;
    //5 - 00000000000000000000000000000101
    int c=a&b;
    int d=a|b;
    int e=a^b;
    printf("c=%d\n",c);
    printf("d=%d\n",d);
    printf("e=%d\n",e);
    return 0;
}

//不创建第三个变量，实现两个int变量的交换
int main()
{
    int a=3;
    int b=5;
    printf("before:a=%d,b=%d\n",a,b);
    //加减法  弊端：a与b相加可能会溢出
    //a=a+b;
    //b=a-b;
    //a=a-b;

    //异或法
    a=a^b;
    b=a^b;
    a=a^b;
    printf("after:a=%d,b=%d\n",a,b);
    return 0;
}

//求一个整数存储在内存中的二进制中1的个数
int main()
{
    int num=0;
    scanf("%d",&num);
    //统计num的补码中1的个数
    int count=0;
    //while(num!=0)
    //{
    //    if(num%2==1)
    //        count++;
    //    num=num/2;
    //}
    //以上算法-1无法计算
    int i=0;
    for(i=0;i<32;i++)
    {
        if(((num>>i)&1)==1)
            count++;
    }
    printf("%d\n",count);
    return 0;
}
*/

/*
赋值操作符
    赋值操作符可以给已有的变量进行重新赋值
    复合赋值符
    +=、-=、*=、/=、%=、>>=、<<=、&=、|=、^=

int main()
{
    int a=10;
    //a=a+2
    a+=2;
    printf("%d",a);
    return 0;
}
*/

/*
单目操作符（只有一个操作数）
    ！- 逻辑反操作          sizeof - 操作数的类型长度（以字节为单位）
    - - 负值                ~ - 对一个数的二进制按位取反
    + - 正值                -- - 前置或后置--
    & - 取地址              ++ - 前置或后置++
    (类型) - 强制类型转换   * - 间接访问操作符（解引用操作符）

int main()
{
    int a=10;
    printf("%d\n",!a);
    int* p=&a;
    *p=20;
    return 0;
}


int main()
{
    int a=10;
    char c='r';
    char* p=&c;
    int arr[10]={0};
    printf("%d\n",sizeof(a));//4
    printf("%d\n",sizeof a);//4
    printf("%d\n",sizeof(int));//4  整型占四个字节

    printf("%d\n",sizeof(c));//1
    printf("%d\n",sizeof(char));//1

    printf("%d\n",sizeof(p));//4
    printf("%d\n",sizeof(char*));//4

    printf("%d\n",sizeof(arr));//40
    printf("%d\n",sizeof(int [10]));//40

    short s=0; //短整型只占两个字节
    printf("%d\n",sizeof(s=a+5)); //sizeof里面的表达式不真实运算
    printf("%d\n",s); //所以s依然是0
    return 0;
}


int main()
{
    int a=11;
    a=a|(1<<2);
    printf("%d\n",a);//15
    a=a&(~(1<<2));
    printf("%d\n",a);//11
    //将11的二进制数里面的0改为1
    //0000000000000000000000000001011 - 11
    //0000000000000000000000000000100 - 1<<2
    //或运算即可
    //改回去
    //0000000000000000000000000001111 - 15
    //1111111111111111111111111111011 - ~(1<<2)
    //与运算


    //int a=0;
    //~按（二进制）位取反
    //00000000000000000000000000000000
    //11111111111111111111111111111111 - 补码
    //11111111111111111111111111111110 - 反码
    //10000000000000000000000000000001 - 原码
    //printf("%d\n",~a);//打印的是原码
    return 0;
}
*/

int main()
{
    int a=10;
    //printf("%d\n",++a);//前置++，先++，后使用
    printf("%d\n",a++);//后置++，先使用，后++
    return 0;
}


