#include <stdio.h>
#include <stdlib.h>

//面试题练习

/*
int main()
{
    int arr[]={1,2,3,4,5};  //int类型占四个字节
    short *p=(short*)arr;  //这里把int类型强制转换成short类型，而short类型占两个字节
    int i=0;
    for(i=0;i<4;i++)  //循环四次，两次才能把一个int类型改成0
    {
        *(p+i)=0;
    }
    for(i=0;i<5;i++)
    {
        printf("%d ",arr[i]);  //结果就是0 0 3 4 5
    }
    return 0;
}
*/

/*
int main()
{
    int a=0x11223344;  //在内存中存放的a其实是倒着来的 - 44 33 22 11
    char *pc=(char*)&a;  //强制转换，char类型占一个字节
    *pc=0;  //这里仅将44 33 22 11中的44改写成了00
    printf("%x\n",a);  //%x是读入16进制整数
    //结果打印出来就是11223300
    return 0;
}
*/

/*
int i;//因为i在这里是一个全局变量，当全局变量不初始化时默认为0
int main()
{
    i--;
    if(i>sizeof(i))//sizeof计算的是数组\类型所占内存的大小 恒>=0 结果是无符号数
    {                 //而这里i=-1，要与sizeof(i)=4进行比较，需要将-1转换成无符号数
        printf(">\n"); // 10000000000000000000000000000001 - 原码
    }                  // 11111111111111111111111111111110 - 反码
    else               // 11111111111111111111111111111111 - 补码
    {                  //当-1转换成无符号数的时候，代表符号位的1就有数字上的意义了，这么大的一个数自然比4大了
        printf("<\n");
    }
    return 0;
}
*/


int main()
{
    int a,b,c;
    a = 5;
    c = ++a; //这里先+1再把值赋给c - c=6 a=6
    b = ++c, c++, ++a, a++;  //因为这里赋值符号'='的优先级大于','，所以要把b = ++c看作逗号表达式的一部分
    // b=7 c=7 ->c=8 ->a=7 ->a=8 总得a=8 b=7 c=8
    b += a++ + c; //这里优先级++ > + > +=
    // a=9 b=25 c=8
    printf("a = %d b = %d c = %d\n",a,b,c);
    return 0;
}

















